Управление_по_целям_и_KPI/src/Catalogs/KPI_Шкалы/KPI_Шкалы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>KPI_Шкалы</name>
  <tabularSections>
    <name>ИнтервалыШкалы</name>
    <attributes>
      <name>НижнийПорог</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВерхнийПорог</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Управление_по_целям_и_KPI/src/Catalogs/KPI_Шкалы/Forms/ФормаЭлемента/Module.bsl
&НаКлиенте
Процедура ЗаполнитьИнтервалыШкалы(Команда)
	
	Если Объект.ИнтервалыШкалы.Количество() Тогда
		ТекстВопроса = "Текущие интервалы шкалы будут очищены. Продолжить?";
		Ответ = Вопрос(ТекстВопроса,РежимДиалогаВопрос.ДаНет);
		Если Ответ = КодВозвратаДиалога.Нет Тогда
			Возврат;
		КонецЕсли;
	КонецЕсли;
	Объект.ИнтервалыШкалы.Очистить();
	ОткрытьФорму("Справочник.KPI_Шкалы.Форма.ФормаПараметрыЗаполненияШкалы",,Элементы.ИнтервалыШкалы);
	
КонецПроцедуры

&НаКлиенте
Процедура ИнтервалыШкалыОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Если ТипЗнч(ВыбранноеЗначение) = Тип("Структура") Тогда
		
		НижнийПорог  = ВыбранноеЗначение.НижнийПорог;
		ВерхнийПорог = ВыбранноеЗначение.ВерхнийПорог;
		Интервал     = ВыбранноеЗначение.Интервал;
		ВерхнееЗначение = ВыбранноеЗначение.МаксимальноеЗначение;
		НижнееЗначение  = ВыбранноеЗначение.МинимальноеЗначение;
		
		Если ВерхнийПорог > НижнийПорог Тогда
			Шагов = (ВерхнийПорог - НижнийПорог)/Интервал;
		Иначе 
			Шагов = (НижнийПорог  - ВерхнийПорог)/Интервал;
			Интервал = Интервал * (-1);
		КонецЕсли;
		
		//Если ВерхнееЗначение > НижнееЗначение Тогда
			Приращение = (ВерхнееЗначение - НижнееЗначение)/Шагов;
		//Иначе 
		//	Приращение = (НижнееЗначение - ВерхнийПорог)/Шагов;
		//КонецЕсли;
		
		Пока Шагов > 0 Цикл
			 нСтр              = Объект.ИнтервалыШкалы.Добавить();
			 нСтр.НижнийПорог  = НижнийПорог;
			 НижнийПорог       = НижнийПорог + Интервал;
			 нСтр.ВерхнийПорог = НижнийПорог;
			 нСтр.Значение     = НижнееЗначение;
			 НижнееЗначение    = НижнееЗначение + Приращение;
			 Шагов             = Шагов - 1;
		 КонецЦикла;
		 
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПостроитьДиаграммуШкалы(Знач ИнтервалыШкалы)
	
	Справочники.KPI_Шкалы.ПостроитьГрафикШкалы(ИнтервалыШкалы,ДиаграммаШкалы);
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ПостроитьДиаграммуШкалы(Объект.ИнтервалыШкалы);
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	ПостроитьДиаграммуШкалы(Объект.ИнтервалыШкалы);	
	
КонецПроцедуры

&НаКлиенте
Процедура ИнтервалыШкалыПриИзменении(Элемент)
	
	ПостроитьДиаграммуШкалы(Объект.ИнтервалыШкалы);
	
КонецПроцедуры
